In [1]:
import pandas as pd

from tqdm import tqdm

In [2]:
df_func = pd.read_excel(r'BD\Dados Vivante Funcionários.xls', sheet_name='DADOS FUNCIONAIS')
df_func.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5463 entries, 0 to 5462
Data columns (total 16 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   MATRÍCULA                   5463 non-null   int64
 1   EMPRESA                     5463 non-null   object
 2   FILIAL                      5463 non-null   object
 3   CNPJ                        5463 non-null   int64
 4   ENDEREÇO FUNCIONAL          5345 non-null   object
 5   LOCALIDADE                  5463 non-null   object
 6   CENTRO DE CUSTO             5463 non-null   object
 7   CENTRO DE RESPONSABILIDADE  5463 non-null   object
 8   SINDICATO                   5463 non-null   object
 9   ADMISSÃO                    5463 non-null   datetime64[ns]
 10  tempo de casa (anos)        5463 non-null   float64
 11  CARGO                       5463 non-null   object
 12  TIPO DE ADMISSÃO            5463 non-null   object
 13  TIPO DE MÃO DE OBRA         5463 non-null   object
 14  TIPO DE SALÁRIO             5463 non-null   object
 15  SALÁRIO                     5463 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(11)
memory usage: 683.0+ KB

In [3]:
df_pess = pd.read_excel(r'BD\Dados Vivante Funcionários.xls', sheet_name='DADOS PESSOAIS')
df_pess.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5463 entries, 0 to 5462
Data columns (total 16 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   MATRÍCULA                    5463 non-null   int64
 1   SEXO                         5463 non-null   object
 2   DATA DE NASCIMENTO           5463 non-null   datetime64[ns]
 3   MÊS DE ANIVERSÁRIO           5463 non-null   object
 4   MÊS DE ANIVERSÁRIO ADMISSÃO  5463 non-null   object
 5   NACIONALIDADE                5463 non-null   object
 6   CIDADE DE NASCIMENTO         5399 non-null   object
 7   UF DE NASCIMENTO             5396 non-null   object
 8   ESTADO CIVIL                 5463 non-null   object
 9   GRAU DE INSTRUÇÃO            5463 non-null   object
 10  ENDEREÇO                     5463 non-null   object
 11  BAIRRO                       5456 non-null   object
 12  CIDADE                       5463 non-null   object
 13  UF                           5463 non-null   object
 14  TELEFONE                     4276 non-null   object
 15  BANCO CONTA CORRENTE         5463 non-null   object
dtypes: datetime64[ns](1), int64(1), object(14)
memory usage: 683.0+ KB

In [4]:
df_func['end'] = df_func['ENDEREÇO FUNCIONAL'] + ' ' + df_func['LOCALIDADE']
df_func = df_func[['MATRÍCULA', 'end']]
df_func.head()

   MATRÍCULA                                                end
0      10438  AVENIDA NAÇÕES UNIDAS - 8º ANDAR, 7815 - PINHE...
1      10515  RUA NORMA PIERUCCINI GIANNOTTI, 327 - BARRA FU...
2      10479  Rua Alexandre Dumas, 2200 - Chacara Santo Anto...
3      10393  RUA NORMA PIERUCCINI GIANNOTTI, 327 - BARRA FU...
4      11879  RUA NORMA PIERUCCINI GIANNOTTI, 327 - BARRA FU...

In [5]:
df_pess['end'] = df_pess['ENDEREÇO'] + ' ' + df_pess['BAIRRO'] + ' ' + df_pess['CIDADE'] + ' ' + df_pess['UF']
df_pess = df_pess[['MATRÍCULA', 'end']]
df_pess.head()

   MATRÍCULA                                                end
0      10438  RUA Andre Casado, 315 Cpos da Escolastica São ...
1      10515  RUA Expedito Rezende L, 12 - Q C Centro Rio de...
2      10479  RUA José Amancio Ferreira, 27 Jardim Kuabara T...
3      10393  RUA Gal Auto, 165/705 - 165/705 Cidade Baixa P...
4      11879  RUA Alvaro Gonçalves Jr, 330 - Bl B Ap 08 Parq...

In [6]:
df_end = df_func[['end']].append(df_pess[['end']])
df_end = df_end.drop_duplicates().reset_index().drop('index', axis=1)
df_end.shape

(5696, 1)

In [7]:
import urllib.request, json

lat = []
lng = []

df_end

for index, row in tqdm(df_end.iterrows()):
    end = str(row['end'])
    end = end.replace(' ', '+').encode('ascii', 'ignore')
    url = 'https://maps.googleapis.com/maps/api/geocode/json?address={}&key=AIzaSyC77zBPX04diBmHimJM7fFgexhveie9dKI'
    url = url.format(end)
    with urllib.request.urlopen(url) as url:
        try:
            data = json.loads(url.read())['results']
            data = data[0]
            data = data['geometry']
            data = data['location']
            lat.append(data['lat'])
            lng.append(data['lng'])
        except:
            lat.append(0)
            lng.append(0)

df_end['LAT'] = lat
df_end['LNG'] = lng

5696it [1:09:06,  1.37it/s]

In [8]:
df_func = df_func.merge(df_end, how='left', on = 'end')
df_pess = df_pess.merge(df_end, how='left', on = 'end')

In [9]:
df_func.dropna(inplace=True)
df_func.shape

(5345, 4)

In [10]:
df_func.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5345 entries, 0 to 5462
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   MATRÍCULA  5345 non-null   int64
 1   end        5345 non-null   object
 2   LAT        5345 non-null   float64
 3   LNG        5345 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 208.8+ KB

In [16]:
df_func.head()

,MATRÍCULA,end,LAT,LNG
0,10438,"AVENIDA NAÇÕES UNIDAS - 8º ANDAR, 7815 - PINHE...",-23.537522,-46.649662
1,10515,"RUA NORMA PIERUCCINI GIANNOTTI, 327 - BARRA FU...",-23.523333,-46.653695
2,10479,"Rua Alexandre Dumas, 2200 - Chacara Santo Anto...",-23.627644,-46.710725
3,10393,"RUA NORMA PIERUCCINI GIANNOTTI, 327 - BARRA FU...",-23.523333,-46.653695
4,11879,"RUA NORMA PIERUCCINI GIANNOTTI, 327 - BARRA FU...",-23.523333,-46.653695

In [17]:
df_func.describe()

           MATRÍCULA          LAT          LNG
count    5345.000000  5345.000000  5345.000000
mean   223121.402058   -22.102213   -45.934905
std     33126.158066     5.766754     5.752035
min      2781.000000   -32.113715   -67.882828
25%    225929.000000   -23.600138   -46.962067
50%    231944.000000   -23.523333   -46.663284
75%    235134.000000   -22.816194   -43.351251
max    236808.000000     2.844315     0.000000

In [12]:
df_pess.dropna(inplace=True)
df_pess.shape

(5456, 4)

In [14]:
df_pess.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5456 entries, 0 to 5462
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   MATRÍCULA  5456 non-null   int64
 1   end        5456 non-null   object
 2   LAT        5456 non-null   float64
 3   LNG        5456 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 213.1+ KB

In [15]:
df_pess.head()

,MATRÍCULA,end,LAT,LNG
0,10438,"RUA Andre Casado, 315 Cpos da Escolastica São ...",-23.541312,-46.689550
1,10515,"RUA Expedito Rezende L, 12 - Q C Centro Rio de...",-22.864110,-43.476026
2,10479,"RUA José Amancio Ferreira, 27 Jardim Kuabara T...",-23.604492,-46.756298
3,10393,"RUA Gal Auto, 165/705 - 165/705 Cidade Baixa P...",-30.034864,-51.231844
4,11879,"RUA Alvaro Gonçalves Jr, 330 - Bl B Ap 08 Parq...",-23.225139,-45.903298

In [11]:
df_func.to_csv(r'BD Tratado\func.csv', sep = ';')
df_pess.to_csv(r'BD Tratado\pess.csv', sep = ';')